{
	"tagName": "a",
	"citeFrom": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/a",
	"attr": [
		"#global",
		{
			"name": "download",
			"description": "This attribute instructs browsers to download a URL instead of navigating to it, so the user will be prompted to save it as a local file. If the attribute has a value, it is used as the pre-filled file name in the Save prompt (the user can still change the file name if they want). There are no restrictions on allowed values, though / and \\ are converted to underscores. Most file systems limit some punctuation in file names, and browsers will adjust the suggested name accordingly.\n Notes:\n \n  This attribute only works for same-origin URLs.\n  This attribute can be used with blob: URLs and data: URLs to download content generated by JavaScript, such as pictures created in an image-editor Web app.\n  If the HTTP header Content-Disposition: gives a different filename than this attribute, the HTTP header takes priority over this attribute.\n  If Content-Disposition: is set to inline, Firefox prioritizes Content-Disposition, like the filename case, while Chrome prioritizes the download attribute.\n \n \n ",
			"obsolete": false
		},
		{
			"name": "href",
			"description": "Contains a URL or a URL fragment that the hyperlink points to.",
			"obsolete": false
		},
		{
			"name": "hreflang",
			"description": "This attribute indicates the human language of the linked resource. It is purely advisory, with no built-in functionality. Allowed values are determined by BCP47.",
			"obsolete": false
		},
		{
			"name": "ping",
			"description": "Contains a space-separated list of URLs to which, when the hyperlink is followed, POST requests with the body PING will be sent by the browser (in the background). Typically used for tracking.",
			"obsolete": false
		},
		{
			"name": "referrerpolicy",
			"description": "Indicates which referrer to send when fetching the URL:\n \n  'no-referrer' means the Referer: header will not be sent.\n  'no-referrer-when-downgrade' means no Referer: header will be sent when navigating to an origin without HTTPS. This is the default behavior.\n  'origin' means the referrer will be the origin of the page, not including information after the domain.\n  'origin-when-cross-origin' meaning that navigations to other origins will be limited to the scheme, the host and the port, while navigations on the same origin will include the referrer's path.\n  'unsafe-url' means the referrer will include the origin and path, but not the fragment, password, or username. This is unsafe because it can leak data from secure URLs to insecure ones.\n \n ",
			"obsolete": false
		},
		{
			"name": "rel",
			"description": "Specifies the relationship of the target object to the link object. The value is a space-separated list of link types.",
			"obsolete": false
		},
		{
			"name": "target",
			"description": "Specifies where to display the linked URL. It is a name of, or keyword for, a browsing context: a tab, window, or <iframe>. The following keywords have special meanings:\n \n  _self: Load the URL into the same browsing context as the current one. This is the default behavior.\n  _blank: Load the URL into a new browsing context. This is usually a tab, but users can configure browsers to use new windows instead.\n  _parent: Load the URL into the parent browsing context of the current one. If there is no parent, this behaves the same way as _self.\n  _top: Load the URL into the top-level browsing context (that is, the \"highest\" browsing context that is an ancestor of the current one, and has no parent). If there is no parent, this behaves the same way as _self.\n \n\n \n Note: When using target, consider adding rel=\"noopener noreferrer\" to avoid exploitation of the window.opener API.\n \n ",
			"obsolete": false
		},
		{
			"name": "type",
			"description": "Specifies the media type in the form of a MIME type for the linked URL. It is purely advisory, with no built-in functionality.",
			"obsolete": false
		},
		{
			"name": "charset",
			"obsolete": true,
			"description": "This attribute defined the character encoding of the linked URL. The value should be a space- and/or comma-delimited list of character sets defined in RFC 2045. The default value is ISO-8859-1.\n \n Usage note: This attribute is obsolete in HTML5 and should not be used by authors. To achieve its effect, use the HTTP Content-Type: header on the linked URL.\n \n "
		},
		{
			"name": "coords",
			"obsolete": true,
			"description": "For use with the below shape attribute, this attribute used a comma-separated list of numbers to define the coordinates of the link on the page."
		},
		{
			"name": "name",
			"obsolete": true,
			"description": "This attribute was required for anchors defining a possible target location within a page. In HTML 4.01, id and name could be used simultaneously on a <a> element as long as they have identical values.\n \n Usage note: This attribute is obsolete in HTML5, use the global attribute id instead.\n \n "
		},
		{
			"name": "rev",
			"obsolete": true,
			"description": "This attribute specified a reverse link, the inverse relationship of the rel attribute. It was deprecated for being very confusing."
		},
		{
			"name": "shape",
			"obsolete": true,
			"description": "This attribute was used to define a region for hyperlinks to create an image map. The values are circle, default, polygon, and rect. The format of the coords attribute depends on the value of shape. For circle, the value is x,y,r where x and y are the pixel coordinates for the center of the circle and r is the radius value in pixels. For rect, the coords attribute should be x,y,w,h. The x,y values define the upper-left-hand corner of the rectangle, while w and h define the width and height respectively. A value of polygon for shape requires x1,y1,x2,y2,... values for coords. Each of the x,y pairs defines a point in the polygon, with successive points being joined by straight lines and the last point joined to the first. The value default for shape requires that the entire enclosed area, typically an image, be used.\n Note: Use the usemap attribute for the <img> element and the associated <map> element to define hotspots instead of the shape attribute.\n "
		}
	],
	"categories": [
		"#Flow",
		"#phrasing",
		"#interactive",
		"#palpable"
	],
	"content": {
		"description": "Transparent, containing either flow content (excluding interactive content) or phrasing content."
	},
	"omission": {
		"description": "None, both the starting and ending tag are mandatory."
	},
	"parents": {
		"description": "Any element that accepts phrasing content, or any element that accepts flow content, but always excluding <a> elements (according to the logical principle of symmetry, if <a> tag, as a parent, can not have interactive content, then the same <a> content can not have <a> tag as its parent)."
	},
	"roles": [
		"button",
		"checkbox",
		"menuitem",
		"menuitemcheckbox",
		"menuitemradio",
		"option",
		"radio",
		"switch",
		"tab",
		"treeitem"
	]
}