{
	"tagName": "audio",
	"citeFrom": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/audio",
	"attr": [
		"#global",
		{
			"name": "autoplay",
			"description": "A Boolean attribute: if specified (even if the value is \"false\"!), the audio will automatically begin playback as soon as it can do so, without waiting for the entire audio file to finish downloading.\n Sites which automatically play audio (or videos with an audio track) can be an unpleasant experience for users, so it should be avoided when possible. If you must offer autoplay functionality, you should make it opt-in (requiring a user to specifically enable it). However, this can be useful when creating media elements whose source will be set at a later time, under user control.\n "
		},
		{
			"name": "buffered",
			"description": "An attribute you can read to determine which time ranges of the media have been buffered. This attribute contains a TimeRanges object."
		},
		{
			"name": "controls",
			"description": "If this attribute is present, the browser will offer controls to allow the user to control audio playback, including volume, seeking, and pause/resume playback."
		},
		{
			"name": "loop",
			"description": "A Boolean attribute: if specified, will automatically seek back to the start upon reaching the end of the audio."
		},
		{
			"name": "mozCurrentSampleOffset",
			"description": "The offset, specified as the number of samples since the beginning of the audio stream, at which the audio is currently playing."
		},
		{
			"name": "muted",
			"description": "A Boolean attribute which indicates whether the audio will be initially silenced. Its default value is false."
		},
		{
			"name": "played",
			"description": "A TimeRanges object indicating all the ranges of the audio that have been played."
		},
		{
			"name": "preload",
			"description": "This enumerated attribute is intended to provide a hint to the browser about what the author thinks will lead to the best user experience. It may have one of the following values:\n \n  none: indicates that the audio should not be preloaded;\n  metadata: indicates that only audio metadata (e.g. length) is fetched;\n  auto: indicates that the whole audio file could be downloaded, even if the user is not expected to use it;\n  the empty string: synonym of the auto value.\n \n\n If not set, its default value is browser-defined (i.e. each browser may have its own default value). The spec advises it to be set to metadata.\n\n Usage notes:\n\n \n  The autoplay attribute has precedence over preload. If autoplay is specified, the browser would obviously need to start downloading the audio for playback.\n  The browser is not forced by the specification to follow the value of this attribute; it is a mere hint.\n \n \n "
		},
		{
			"name": "src",
			"description": "The URL of the audio to embed. This is subject to HTTP access controls. This is optional; you may instead use the <source> element within the audio block to specify the audio to embed."
		},
		{
			"name": "volume",
			"description": "The playback volume, in the range 0.0 (silent) to 1.0 (loudest)."
		}
	],
	"categories": [
		"#Flow",
		"#phrasing",
		"#embedded",
		"#interactive",
		"#palpable"
	],
	"content": {
		"description": "If the element has a src attribute: zero or more <track> element, followed by transparent content that contains no media elements, that is no <audio> or <video>\n    Else: zero or more <source> element, followed by zero or more <track> element, followed by transparent content that contains no media elements, that is no <audio> or <video>."
	},
	"omission": {
		"description": "None, both the starting and ending tag are mandatory."
	},
	"parents": {
		"description": "Any element that accepts embedded content."
	},
	"roles": [
		"application"
	]
}