{
	"attr": [
		"#global",
		{
			"name": "checked",
			"description": "Boolean attribute which indicates whether the command is selected. May only be used when the type attribute is checkbox or radio."
		},
		{
			"name": "command",
			"description": "Specifies the ID of a separate element, indicating a command to be invoked indirectly. May not be used within a menu item that also includes the attributes checked, disabled, icon, label, radiogroup or type."
		},
		{
			"name": "default",
			"description": "This Boolean attribute indicates use of the same command as the menu's subject element (such as a button or input)."
		},
		{
			"name": "disabled",
			"description": "Boolean attribute which indicates that the command is not available in the current state. Note that disabled is distinct from hidden; the disabled attribute is appropriate in any context where a change in circumstances might render the command relevant."
		},
		{
			"name": "icon",
			"description": "Image URL, used to provide a picture to represent the command."
		},
		{
			"name": "label",
			"description": "The name of the command as shown to the user. Required when a command attribute is not present."
		},
		{
			"name": "radiogroup",
			"description": "This attribute specifies the name of a group of commands to be toggled as radio buttons when selected. May only be used where the type attribute is radio."
		},
		{
			"name": "type",
			"description": "This attribute indicates the kind of command, and can be one of three values.\n \n  command: A regular command with an associated action. This is the missing value default.\n  checkbox: Represents a command that can be toggled between two different states.\n  radio: Represent one selection from a group of commands that can be toggled as radio buttons.\n \n "
		}
	],
	"categories": [],
	"content": "None, it is an empty element.",
	"omission": "Must have a start tag and must not have an end tag.",
	"parents": "The <menu> element, where that element is in the popup menu state. (If specified, the type attribute of the <menu> element must be popup; if missing, the parent element of the <menu> must itself be a <menu> in the popup menu state.)",
	"roles": [
		"None"
	]
}