{
	"tagName": "source",
	"citeFrom": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/source",
	"attr": [
		"#global",
		{
			"name": "sizes",
			"description": "Is a list of source sizes that describes the final rendered width of the image represented by the source. Each source size consists of a comma-separated list of media condition-length pairs. This information is used by the browser to determine, before laying the page out, which image defined in srcset to use.\n The sizes attribute has an effect only when the <source> element is the direct child of a <picture> element."
		},
		{
			"name": "src",
			"description": "Required for <audio> and <video>, address of the media resource. The value of this attribute is ignored when the <source> element is placed inside a <picture> element."
		},
		{
			"name": "srcset",
			"description": "A list of one or more strings separated by commas indicating a set of possible images represented by the source for the browser to use. Each string is composed of:\n \n  one URL to an image,\n  a width descriptor, that is a positive integer directly followed by 'w'. The default value, if missing, is the infinity.\n  a pixel density descriptor, that is a positive floating number directly followed by 'x'. The default value, if missing, is 1x.\n \n\n Each string in the list must have at least a width descriptor or a pixel density descriptor to be valid. Among the list, there must be only one string containing the same tuple of width descriptor and pixel density descriptor.\n  The browser chooses the most adequate image to display at a given point of time.\n  The srcset attribute has an effect only when the <source> element is the direct child of a <picture> element.\n "
		},
		{
			"name": "type",
			"description": "The MIME-type of the resource, optionally with a codecs parameter. See RFC 4281 for information about how to specify codecs."
		},
		{
			"name": "media",
			"description": "Media query of the resource's intended media; this should be used only in a <picture> element."
		}
	],
	"categories": [],
	"content": {
		"description": "None, it is an empty element."
	},
	"omission": {
		"description": "It must have start tag, but must not have an end tag."
	},
	"parents": {
		"description": "A media element—<audio> or <video>—and it must be placed before any flow content or <track> element.\n\n    A <picture> element, and it must be placed before the <img> element."
	},
	"roles": [
		"None"
	]
}