{
	"tagName": "track",
	"citeFrom": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/track",
	"attr": [
		"#global",
		{
			"name": "default",
			"description": "This attribute indicates that the track should be enabled unless the user's preferences indicate that another track is more appropriate. This may only be used on one track element per media element."
		},
		{
			"name": "kind",
			"description": "How the text track is meant to be used. If omitted the default kind is subtitles. If the attribute is not present, it will use the subtitles. If the attribute contains an invalid value, it will use metadata. (Versions of Chrome earlier than 52 treated an invalid value as subtitles.) The following keywords are allowed:\n \n  subtitles\n   \n    Subtitles provide translation of content that cannot be understood by the viewer. For example dialogue or text that is not English in an English language film.\n    Subtitles may contain additional content, usually extra background information. For example the text at the beginning of the Star Wars films, or the date, time, and location of a scene.\n   \n  \n  captions\n   \n    Closed captions provide a transcription and possibly a translation of audio.\n    It may include important non-verbal information such as music cues or sound effects. It may indicate the cue's source (e.g. music, text, character).\n    Suitable for users who are deaf or when the sound is muted.\n   \n  \n  descriptions\n   \n    Textual description of the video content.\n    Suitable for users who are blind or where the video cannot be seen.\n   \n  \n  chapters\n   \n    Chapter titles are intended to be used when the user is navigating the media resource.\n   \n  \n  metadata\n   \n    Tracks used by scripts. Not visible to the user.\n   \n  \n \n "
		},
		{
			"name": "label",
			"description": "A user-readable title of the text track which is used by the browser when listing available text tracks."
		},
		{
			"name": "src",
			"description": "Address of the track (.vtt file). Must be a valid URL. This attribute must be defined."
		},
		{
			"name": "srclang",
			"description": "Language of the track text data. It must be a valid BCP 47 language tag. If the kind attribute is set to subtitles, then srclang must be defined."
		}
	],
	"categories": [],
	"content": {
		"description": "None, it is an empty element."
	},
	"omission": {
		"description": "As it is a void element, the start tag must be present and the end tag must not be present."
	},
	"parents": {
		"description": "A media element, before any flow content."
	},
	"roles": [
		"None"
	]
}